qmckl_blas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-29 Wed 11:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BLAS functions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">BLAS functions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7ea2650">-</a></li>
<li><a href="#org0b63e85">1. Data types</a>
<ul>
<li><a href="#org84166e6">1.1. Vector</a></li>
<li><a href="#orgd796bd6">1.2. Matrix</a></li>
<li><a href="#orge45c665">1.3. Tensor</a></li>
<li><a href="#org96c6908">1.4. Reshaping</a>
<ul>
<li><a href="#org5af928a">1.4.1. Vector -&gt; Matrix</a></li>
<li><a href="#org304badd">1.4.2. Vector -&gt; Tensor</a></li>
<li><a href="#orgeea4e3e">1.4.3. Matrix -&gt; Vector</a></li>
<li><a href="#org5d0f04d">1.4.4. Matrix -&gt; Tensor</a></li>
<li><a href="#org2db4445">1.4.5. Tensor -&gt; Vector</a></li>
<li><a href="#orgdb79daf">1.4.6. Tensor -&gt; Matrix</a></li>
</ul>
</li>
<li><a href="#org4333db7">1.5. Access macros</a></li>
<li><a href="#orgf537d11">1.6. Set all elements</a>
<ul>
<li><a href="#org60e9704">1.6.1. Vector</a></li>
<li><a href="#org4a6ed26">1.6.2. Matrix</a></li>
<li><a href="#org10245ce">1.6.3. Tensor</a></li>
</ul>
</li>
<li><a href="#org1ec0698">1.7. Copy to/from to <code>double*</code></a></li>
</ul>
</li>
<li><a href="#org09ac7d4">2. Matrix operations</a>
<ul>
<li><a href="#orgc33e47b">2.1. <code>qmckl_dgemm</code></a></li>
<li><a href="#org058e495">2.2. <code>qmckl_matmul</code></a></li>
<li><a href="#org17504f4">2.3. <code>qmckl_adjugate</code></a></li>
<li><a href="#org066a2c7">2.4. <code>qmckl_transpose</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7ea2650" class="outline-2">
<h2 id="org7ea2650">-</h2>
<div class="outline-text-2" id="text-org7ea2650">
<p>
Basic linear algebra data types and operations are described in this file.
The data types are private, so that HPC implementations can use
whatever data structures they prefer.
</p>

<p>
These data types are expected to be used internally in QMCkl. They
are not intended to be passed to external codes.
</p>
</div>
</div>

<div id="outline-container-org0b63e85" class="outline-2">
<h2 id="org0b63e85"><span class="section-number-2">1</span> Data types</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org84166e6" class="outline-3">
<h3 id="org84166e6"><span class="section-number-3">1.1</span> Vector</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>size</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Dimension of the vector</td>
</tr>

<tr>
<td class="org-left"><code>data</code></td>
<td class="org-left"><code>double*</code></td>
<td class="org-left">Elements</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_vector</span>
<span style="color: #0000ff;">qmckl_vector_alloc</span>( <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>);
</pre>
</div>

<p>
Allocates a new vector. If the allocation failed the size is zero.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_vector_free</span>( <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                   <span style="color: #228b22;">qmckl_vector</span>* <span style="color: #a0522d;">vector</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd796bd6" class="outline-3">
<h3 id="orgd796bd6"><span class="section-number-3">1.2</span> Matrix</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>size</code></td>
<td class="org-left"><code>int64_t[2]</code></td>
<td class="org-left">Dimension of each component</td>
</tr>

<tr>
<td class="org-left"><code>data</code></td>
<td class="org-left"><code>double*</code></td>
<td class="org-left">Elements</td>
</tr>
</tbody>
</table>

<p>
The dimensions use Fortran ordering: two elements differing by one
in the first dimension are consecutive in memory.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_matrix</span>
<span style="color: #0000ff;">qmckl_matrix_alloc</span>( <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size1</span>,
                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size2</span>);
</pre>
</div>

<p>
Allocates a new matrix. If the allocation failed the sizes are zero.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_matrix_free</span>( <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                   <span style="color: #228b22;">qmckl_matrix</span>* <span style="color: #a0522d;">matrix</span>);
</pre>
</div>
</div>
</div>
