qmckl_blas.html

<div id="outline-container-orge45c665" class="outline-3">
<h3 id="orge45c665"><span class="section-number-3">1.3</span> Tensor</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>order</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Order of the tensor</td>
</tr>

<tr>
<td class="org-left"><code>size</code></td>
<td class="org-left"><code>int64_t[QMCKL_TENSOR_ORDER_MAX]</code></td>
<td class="org-left">Dimension of each component</td>
</tr>

<tr>
<td class="org-left"><code>data</code></td>
<td class="org-left"><code>double*</code></td>
<td class="org-left">Elements</td>
</tr>
</tbody>
</table>

<p>
The dimensions use Fortran ordering: two elements differing by one
in the first dimension are consecutive in memory.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_tensor</span>
<span style="color: #0000ff;">qmckl_tensor_alloc</span>( <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">order</span>,
                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">size</span>);
</pre>
</div>

<p>
Allocates memory for a tensor. If the allocation failed, the size
is zero.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_tensor_free</span> (<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, 
                   <span style="color: #228b22;">qmckl_tensor</span>* <span style="color: #a0522d;">tensor</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org96c6908" class="outline-3">
<h3 id="org96c6908"><span class="section-number-3">1.4</span> Reshaping</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Reshaping occurs in-place and the pointer to the data is copied.
</p>
</div>

<div id="outline-container-org5af928a" class="outline-4">
<h4 id="org5af928a"><span class="section-number-4">1.4.1</span> Vector -&gt; Matrix</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_matrix</span>
<span style="color: #0000ff;">qmckl_matrix_of_vector</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_vector</span> <span style="color: #a0522d;">vector</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size1</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size2</span>);
</pre>
</div>

<p>
Reshapes a vector into a matrix.
</p>
</div>
</div>

<div id="outline-container-org304badd" class="outline-4">
<h4 id="org304badd"><span class="section-number-4">1.4.2</span> Vector -&gt; Tensor</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_tensor</span>
<span style="color: #0000ff;">qmckl_tensor_of_vector</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_vector</span> <span style="color: #a0522d;">vector</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">order</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">size</span>);
</pre>
</div>

<p>
Reshapes a vector into a tensor.
</p>
</div>
</div>

<div id="outline-container-orgeea4e3e" class="outline-4">
<h4 id="orgeea4e3e"><span class="section-number-4">1.4.3</span> Matrix -&gt; Vector</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_vector</span>
<span style="color: #0000ff;">qmckl_vector_of_matrix</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">matrix</span>);
</pre>
</div>

<p>
Reshapes a matrix into a vector.
</p>
</div>
</div>

<div id="outline-container-org5d0f04d" class="outline-4">
<h4 id="org5d0f04d"><span class="section-number-4">1.4.4</span> Matrix -&gt; Tensor</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_tensor</span>
<span style="color: #0000ff;">qmckl_tensor_of_matrix</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">matrix</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">order</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">size</span>);
</pre>
</div>

<p>
Reshapes a matrix into a tensor.
</p>
</div>
</div>

<div id="outline-container-org2db4445" class="outline-4">
<h4 id="org2db4445"><span class="section-number-4">1.4.5</span> Tensor -&gt; Vector</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_vector</span>
<span style="color: #0000ff;">qmckl_vector_of_tensor</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">tensor</span>);
</pre>
</div>

<p>
Reshapes a tensor into a vector.
</p>
</div>
</div>

<div id="outline-container-orgdb79daf" class="outline-4">
<h4 id="orgdb79daf"><span class="section-number-4">1.4.6</span> Tensor -&gt; Matrix</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_matrix</span>
<span style="color: #0000ff;">qmckl_matrix_of_tensor</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">tensor</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size1</span>,
                       <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size2</span>);
</pre>
</div>

<p>
Reshapes a tensor into a vector.
</p>
</div>
</div>
</div>
