qmckl_blas.html

<div id="outline-container-org4333db7" class="outline-3">
<h3 id="org4333db7"><span class="section-number-3">1.5</span> Access macros</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Macros are provided to ease the access to vectors, matrices and
tensors. Matrices use column-major ordering, as in Fortran.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_vec</span> (<span style="color: #228b22;">qmckl_vector</span> <span style="color: #a0522d;">v</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>);           //  <span style="color: #b22222;">v[i] </span>
<span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_mat</span> (<span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">m</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">j</span>) // <span style="color: #b22222;">m[j][i]</span>

<span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_ten3</span>(<span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">t</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">j</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">k</span>); // <span style="color: #b22222;">t[k][j][i]</span>
<span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_ten4</span>(<span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">t</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">j</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">k</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">l</span>);
<span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_ten5</span>(<span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">t</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">j</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">k</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">l</span>, <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">m</span>);
...
</pre>
</div>

<p>
For example:
</p>
</div>
</div>

<div id="outline-container-orgf537d11" class="outline-3">
<h3 id="orgf537d11"><span class="section-number-3">1.6</span> Set all elements</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org60e9704" class="outline-4">
<h4 id="org60e9704"><span class="section-number-4">1.6.1</span> Vector</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_vector</span>
<span style="color: #0000ff;">qmckl_vector_set</span>(<span style="color: #228b22;">qmckl_vector</span> <span style="color: #a0522d;">vector</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a6ed26" class="outline-4">
<h4 id="org4a6ed26"><span class="section-number-4">1.6.2</span> Matrix</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_matrix</span>
<span style="color: #0000ff;">qmckl_matrix_set</span>(<span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">matrix</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org10245ce" class="outline-4">
<h4 id="org10245ce"><span class="section-number-4">1.6.3</span> Tensor</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_tensor</span>
<span style="color: #0000ff;">qmckl_tensor_set</span>(<span style="color: #228b22;">qmckl_tensor</span> <span style="color: #a0522d;">tensor</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">value</span>);
</pre>
</div>
</div>
</div>
</div>
