qmckl_blas.html
<div id="outline-container-orgc33e47b" class="outline-3">
<h3 id="orgc33e47b"><span class="section-number-3">2.1</span> <code>qmckl_dgemm</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Matrix multiplication with a BLAS interface:
</p>

<p>
\[
   C_{ij} = \beta C_{ij} + \alpha \sum_{k} A_{ik} \cdot B_{kj}
   \]
</p>

<table id="orgc90c4a3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>TransA</code></td>
<td class="org-left"><code>char</code></td>
<td class="org-left">in</td>
<td class="org-left">'T' is transposed</td>
</tr>

<tr>
<td class="org-left"><code>TransB</code></td>
<td class="org-left"><code>char</code></td>
<td class="org-left">in</td>
<td class="org-left">'T' is transposed</td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of rows of the input matrix</td>
</tr>

<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of columns of the input matrix</td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of columns of the input matrix</td>
</tr>

<tr>
<td class="org-left"><code>alpha</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">in</td>
<td class="org-left">&alpha;</td>
</tr>

<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left"><code>double[][lda]</code></td>
<td class="org-left">in</td>
<td class="org-left">Array containing the matrix \(A\)</td>
</tr>

<tr>
<td class="org-left"><code>lda</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of array <code>A</code></td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>double[][ldb]</code></td>
<td class="org-left">in</td>
<td class="org-left">Array containing the matrix \(B\)</td>
</tr>

<tr>
<td class="org-left"><code>ldb</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of array <code>B</code></td>
</tr>

<tr>
<td class="org-left"><code>beta</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">in</td>
<td class="org-left">&beta;</td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left"><code>double[][ldc]</code></td>
<td class="org-left">out</td>
<td class="org-left">Array containing the matrix \(C\)</td>
</tr>

<tr>
<td class="org-left"><code>ldc</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of array <code>C</code></td>
</tr>
</tbody>
</table>

<p>
Requirements:
</p>

<ul class="org-ul">
<li><code>context</code> is not <code>QMCKL_NULL_CONTEXT</code></li>
<li><code>m &gt; 0</code></li>
<li><code>n &gt; 0</code></li>
<li><code>k &gt; 0</code></li>
<li><code>lda &gt;= m</code></li>
<li><code>ldb &gt;= n</code></li>
<li><code>ldc &gt;= n</code></li>
<li><code>A</code> is allocated with at least \(m \times k \times 8\) bytes</li>
<li><code>B</code> is allocated with at least \(k \times n \times 8\) bytes</li>
<li><code>C</code> is allocated with at least \(m \times n \times 8\) bytes</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_dgemm</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">TransA</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">TransB</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">m</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">k</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">alpha</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">A</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">lda</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">B</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">ldb</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">beta</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">C</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">ldc</span> ); 
</pre>
</div>
</div>
</div>
