qmckl_blas.html

<div id="outline-container-org058e495" class="outline-3">
<h3 id="org058e495"><span class="section-number-3">2.2</span> <code>qmckl_matmul</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Matrix multiplication using the <code>qmckl_matrix</code> data type:
</p>

<p>
\[
   C_{ij} = \beta C_{ij} + \alpha \sum_{k} A_{ik} \cdot B_{kj}
   \]
</p>

<table id="org9bf2bc7" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>TransA</code></td>
<td class="org-left"><code>char</code></td>
<td class="org-left">in</td>
<td class="org-left">'T' is transposed</td>
</tr>

<tr>
<td class="org-left"><code>TransB</code></td>
<td class="org-left"><code>char</code></td>
<td class="org-left">in</td>
<td class="org-left">'T' is transposed</td>
</tr>

<tr>
<td class="org-left"><code>alpha</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">in</td>
<td class="org-left">&alpha;</td>
</tr>

<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left"><code>qmckl_matrix</code></td>
<td class="org-left">in</td>
<td class="org-left">Matrix \(A\)</td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>qmckl_matrix</code></td>
<td class="org-left">in</td>
<td class="org-left">Matrix \(B\)</td>
</tr>

<tr>
<td class="org-left"><code>beta</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">in</td>
<td class="org-left">&beta;</td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left"><code>qmckl_matrix</code></td>
<td class="org-left">out</td>
<td class="org-left">Matrix \(C\)</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_matmul</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">TransA</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">TransB</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">alpha</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">A</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_matrix</span> <span style="color: #a0522d;">B</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">beta</span>,
      <span style="color: #228b22;">qmckl_matrix</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">C</span> ); 
</pre>
</div>
</div>
</div>
