qmckl_blas.html

<div id="outline-container-org17504f4" class="outline-3">
<h3 id="org17504f4"><span class="section-number-3">2.3</span> <code>qmckl_adjugate</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Given a matrix \(\mathbf{A}\), the adjugate matrix
\(\text{adj}(\mathbf{A})\) is the transpose of the cofactors matrix
of \(\mathbf{A}\).
</p>

<p>
\[
   \mathbf{B} = \text{adj}(\mathbf{A}) = \text{det}(\mathbf{A}) \, \mathbf{A}^{-1}
   \]
</p>

<p>
See also: <a href="https://en.wikipedia.org/wiki/Adjugate_matrix">https://en.wikipedia.org/wiki/Adjugate_matrix</a>
</p>

<table id="org29939c9" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of rows and columns of the input matrix</td>
</tr>

<tr>
<td class="org-left"><code>A</code></td>
<td class="org-left"><code>double[][lda]</code></td>
<td class="org-left">in</td>
<td class="org-left">Array containing the \(n \times n\) matrix \(A\)</td>
</tr>

<tr>
<td class="org-left"><code>lda</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of array <code>A</code></td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>double[][ldb]</code></td>
<td class="org-left">out</td>
<td class="org-left">Adjugate of \(A\)</td>
</tr>

<tr>
<td class="org-left"><code>ldb</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Leading dimension of array <code>B</code></td>
</tr>

<tr>
<td class="org-left"><code>det_l</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">inout</td>
<td class="org-left">determinant of \(A\)</td>
</tr>
</tbody>
</table>

<p>
Requirements:
</p>

<ul class="org-ul">
<li><code>context</code> is not <code>QMCKL_NULL_CONTEXT</code></li>
<li><code>n &gt; 0</code></li>
<li><code>lda &gt;= m</code></li>
<li><code>A</code> is allocated with at least \(m \times m \times 8\) bytes</li>
<li><code>ldb &gt;= m</code></li>
<li><code>B</code> is allocated with at least \(m \times m \times 8\) bytes</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_adjugate</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">n</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">A</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">lda</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">B</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">ldb</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">det_l</span> ); 
</pre>
</div>

<p>
For small matrices (&le; 5&times; 5), we use specialized routines
for performance motivations. For larger sizes, we rely on the
LAPACK library.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">subroutine</span> <span style="color: #0000ff;">adjugate_general</span>(context, na, A, LDA, B, LDB, det_l)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in) ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">intent</span>(in)       ::<span style="color: #a0522d;"> A (LDA,na)</span>
  <span style="color: #228b22;">integer</span>*8, <span style="color: #a020f0;">intent</span>(in)              ::<span style="color: #a0522d;"> LDA</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">intent</span>(out)      ::<span style="color: #a0522d;"> B (LDB,na)</span>
  <span style="color: #228b22;">integer</span>*8, <span style="color: #a020f0;">intent</span>(in)              ::<span style="color: #a0522d;"> LDB</span>
  <span style="color: #228b22;">integer</span>*8, <span style="color: #a020f0;">intent</span>(in)              ::<span style="color: #a0522d;"> na</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">intent</span>(inout)    ::<span style="color: #a0522d;"> det_l</span>

  <span style="color: #228b22;">double precision</span> ::<span style="color: #a0522d;"> work(LDA*max(na,64))</span>
  <span style="color: #228b22;">integer</span>          ::<span style="color: #a0522d;"> inf</span>
  <span style="color: #228b22;">integer</span>          ::<span style="color: #a0522d;"> ipiv(LDA)</span>
  <span style="color: #228b22;">integer</span>          ::<span style="color: #a0522d;"> lwork</span>
  <span style="color: #228b22;">integer</span>(8)       ::<span style="color: #a0522d;"> i, j</span>

</pre>
</div>

<p>
We first copy the array <code>A</code> into array <code>B</code>.
</p>

<div class="org-src-container">
<pre class="src src-f90">B(1:na,1:na) = A(1:na,1:na)
</pre>
</div>

<p>
Then, we compute the LU factorization \(LU=A\)
using the <code>dgetrf</code> routine.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">call</span> <span style="color: #0000ff;">dgetrf</span>(na, na, B, LDB, ipiv, inf )
</pre>
</div>

<p>
By convention, the determinant of \(L\) is equal to one, so the
determinant of \(A\) is equal to the determinant of \(U\), which is
simply computed as the product of its diagonal elements.
</p>

<div class="org-src-container">
<pre class="src src-f90">det_l = 1.d0
j=0_8
<span style="color: #a020f0;">do</span> i=1,na
 j = j+<span style="color: #a020f0;">min</span>(<span style="color: #a020f0;">abs</span>(ipiv(i)-i),1)
 det_l = det_l*B(i,i)
<span style="color: #a020f0;">enddo</span>
</pre>
</div>

<p>
As <code>dgetrf</code> returns \(PLU=A\) where \(P\) is a permutation matrix, the
sign of the determinant is computed as \(-1^m\) where \(m\) is the
number of permutations.
</p>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">if</span> (<span style="color: #a020f0;">iand</span>(j,1_8) /= 0_8)  <span style="color: #a020f0;">then</span>
  det_l = -det_l
<span style="color: #a020f0;">endif</span>
</pre>
</div>

<p>
Then, the inverse of \(A\) is computed using <code>dgetri</code>:
</p>

<div class="org-src-container">
<pre class="src src-f90">lwork = <span style="color: #a020f0;">SIZE</span>(work)
<span style="color: #a020f0;">call</span> <span style="color: #0000ff;">dgetri</span>(na, B, LDB, ipiv, work, lwork, inf )
</pre>
</div>

<p>
and the adjugate matrix is computed as the product of the
determinant with the inverse:
</p>

<div class="org-src-container">
<pre class="src src-f90">  B(:,:) = B(:,:)*det_l

<span style="color: #a020f0;">end subroutine</span> <span style="color: #0000ff;">adjugate_general</span>
</pre>
</div>
</div>
</div>
